[
  
  {
    "productId": 1,
    "productName": "2 Pac : All Eyes On Me",
    "productCode": "ALEOM",
    "releaseDate": "February 13, 1996",
    "description": " is the fourth studio album by American rapper 2Pac and the last to be released during his lifetime. Released on February 13, 1996, by Death Row Records and Interscope Record, All Eyez on Me features guest appearances from several artists including The Outlawz, Dr. Dre, Snoop Dogg, George Clinton, E-40, Redman, Method Man, Tha Dogg Pound, K-Ci & JoJo, Roger Troutman, among others. The album features productions by Shakur alongside a variety of producers, including DJ Quik, Johnny J, Dr. Dre, Rick Rock, Daz Dillinger, DJ Pooh, DeVante Swing, among others",
    "price": 500,
    "starRating": 5,
    "imageUrl": "assets/images/2pac-Alleyezonme.jpg"
  },
  {
    "productId": 2,
    "productName": "Ab Soul : Control System",
    "productCode": "CS",
    "releaseDate": "May 11, 2012",
    "description": "is the second studio album by American rapper Ab-Soul. It was released on May 11, 2012, by Top Dawg Entertainment. The album features guest appearances from Jhené Aiko, Danny Brown, Schoolboy Q, Jay Rock, BJ the Chicago Kid, Kendrick Lamar, JaVonte, Punch, Ashtrobot and vocals from the late Alori Joh. The album's production was handled by Digi+Phonics, King Blue, Nez & Rio, Skhye Hutch, Curtiss King, Aahyasis, and Tommy Black",
    "price": 200.95,
    "starRating": 3.2,
    "imageUrl": "assets/images/AbSoul-Control-System.jpeg"
  },
  {
    "productId": 3,
    "productName": "Jay Z : Blueprint",
    "productCode": "BP",
    "releaseDate": "September 11, 2001",
    "description": "The Blueprint is the sixth studio album by American rapper Jay-Z. It was released on September 11, 2001, by Roc-A-Fella Records and Def Jam Recordings. Its release was set a week earlier than initially planned in order to combat bootlegging. Recording sessions for the album took place during 2001 at Manhattan Center Studios and Baseline Studios in New York City. Contrasting the radio-friendly sound of Jay-Z's previous work, The Blueprint features soul-based sampling and production handled primarily by Kanye West, Just Blaze, and Bink, as well as Timbaland, Trackmasters, and Eminem, who also contributes the album's sole guest feature.",
    "price": 190,
    "starRating": 4,
    "imageUrl": "assets/images/JayZ-Blueprint.png"
  },
  {
    "productId": 4,
    "productName": "J Cole : Forest Hills Drive",
    "productCode": "FHD",
    "releaseDate": "December 9, 2014",
    "description": "2014 Forest Hills Drive is the third studio album by American rapper J. Cole. It was released on December 9, 2014, by ByStorm Entertainment, Columbia Records, Dreamville Records and Roc Nation.Recording sessions took place over the whole year, while the production on the album was primarily handled by Cole himself, along with several others such as Illmind, Vinylz, Phonix Beats and Willie B. It was announced three weeks before its release and had very little marketing, with no singles or promotion taking place prior to its release.",
    "price": 210.95,
    "starRating": 3.2,
    "imageUrl": "assets/images/JCole-ForestHillsDrive.jpg"
  },
  {
    "productId": 5,
    "productName": "Joey Bada$$ : B4DA$$",
    "productCode": "BD$",
    "releaseDate": "January 20, 2015",
    "description": "B4.Da.$$ (pronounced Before Da Money) is the debut studio album by American rapper Joey Badass. It was released on January 20, 2015, his 20th birthday, by Cinematic Music Group and Relentless Records. The album was released in North America and United Kingdom, as well as being made available for digital download on iTunes. The album debuted at number five on the Billboard 200, selling 54,000 copies in the first week in the United States",
    "price": 300,
    "starRating": 6,
    "imageUrl": "assets/images/JoeyBad$$-B4DA$$.jpg"
  },
  {
    "productId": 6,
    "productName": "Kanye West : Graduation",
    "productCode": "GDN",
    "releaseDate": "September 11, 2007",
    "description": "Graduation is the third studio album by American rapper and producer Kanye West, released on September 11, 2007, through Def Jam Recordings and Roc-A-Fella Records. Recording sessions took place between 2005 and 2007 at several studios in New York and Los Angeles. It was primarily produced by West himself, with contributions from various other producers. The album also features guest appearances from recording artists such as Dwele, T-Pain, Lil Wayne, DJ Premier, and Chris Martin of Coldplay.",
    "price": 240,
    "starRating": 4.5,
    "imageUrl": "assets/images/KanyeWest-Graduation.jpg"
  },
  {
    "productId": 7,
    "productName": "KOTA The Friend : FOTO",
    "productCode": "FT",
    "releaseDate": "June 19, 2020",
    "description": "Clocking in at just under 40 minutes, the 12-track album features a number of high-profile guest appearances from the likes of Joey Bada$$ and Bas on “B.Q.E.,” LaKeith Stanfield and Lupita Nyong’o on “LaKeith’s Interlude” and “Lupita’s Interlude” and the rapper’s son Lil Kota on the outro",
    "price": 150,
    "starRating": 3.5,
    "imageUrl": "assets/images/KOTATheFriend-FOTO.jpg"
  },
  {
    "productId": 8,
    "productName": "Mac Miller : Faces",
    "productCode": "FCS",
    "releaseDate": "May 11, 2014",
    "description": "Faces is the eleventh mixtape by American rapper Mac Miller. It was independently released for free download on May 11, 2014. The mixtape is the follow-up to Miller's second studio album Watching Movies with the Sound Off (2013), and is considered by many to be his magnum opus for its dark and personal exploration of Miller's struggle with drug addiction.",
    "price": 400,
    "starRating": 5,
    "imageUrl": "assets/images/MacMiller-Faces.jpg"
  },
  {
    "productId": 9,
    "productName": "Pro Era : The Aprocalypse",
    "productCode": "TP",
    "releaseDate": "May 21, 2012",
    "description": "Pro Era taps into the feeling of hearing a certain style of music outside of what's current and thoroughly believing it's all you'll ever need. They operate with a sincerity that can prove to be disarming but it'll take more focus on individual voices to make Pro Era that group for a new set of kids.",
    "price": 500,
    "starRating": 5,
    "imageUrl": "assets/images/ProEra-TheAprocalypse.jpg"
  },
  {
    "productId": 10,
    "productName": "Rick Ross : Teflon Don",
    "productCode": "TD",
    "releaseDate": "July 20, 2010",
    "description": "Teflon Don is the fourth studio album by American rapper Rick Ross, released on July 20, 2010, on Maybach Music Group, Slip-n-Slide Records and Def Jam Recordings. Production for the album took place during 2009 to 2010 and was handled by several record producers, including Clark Kent, No I.D., The Olympicks, J.U.S.T.I.C.E. League, Lex Luger, Danja, The Inkredibles, The Remedy and Kanye West.",
    "price": 99.50,
    "starRating": 2,
    "imageUrl": "assets/images/RickRoss-TeflonDon.jpg"
  },
  {
    "productId": 11,
    "productName": "Wiz Khalifa : Rolling Papers",
    "productCode": "RP",
    "releaseDate": "March 28, 2011",
    "description": "Rolling Papers is the third studio album by American rapper Wiz Khalifa. It was released on March 28, 2011, by Atlantic Records and Rostrum Records. It is his first album under a major label after his independent releases, Show and Prove and Deal or No Deal. The album features guest appearances from Too $hort, Curren$y and Chevy Woods.",
    "price": 350,
    "starRating": 4.0,
    "imageUrl": "assets/images/rolling-papers-cover.jpg"
  }
]